<template>
  <div :class="$style.container">
    <el-collapse v-model="activeNames" @change="handleChange" accordion>
      <el-collapse-item name="1">
        <div slot="title" :class="$style.title">
          课程建设目标
        </div>
        <div :class="$style.content">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本着建设成“一流师资队伍、一流教学内容、一流教学方法、一流教材、一流教学管理、一流的学生自主性学习实验基地”的目标，以转变教育思想、教育观念为先导，
          以提高教育质量为核心，以教学内容和手段的改革为关键，以师资队伍建设和教学条件建设为基础，以课程管理为保障，以专业外语课堂教学和网络教学有机融合玮突破点，打造专业外语精品课程，使该课程在省级精品课程和校级精品资源共享课建设的基础上，力求向省级精品资源共享课乃至国家级精品资源共享课程建设迈进，最终使大学英语课程拥有更优秀的师资、更先进的课程教学体系、教学方法、教学手段、教材建设等方面有突破性的进步、更成熟完备的课程教学网络基地和体系，同时发挥精品课程的示范、辐射作用，带动我院的课程建设，提高我院的课程教学质量。
        </div>
      </el-collapse-item>
      <el-collapse-item name="2">
        <div slot="title" :class="$style.title">
          课程定位
        </div>
        <div :class="$style.content">
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本着建设成“一流师资队伍、一流教学内容、一流教学方法、一流教材、一流教学管理、一流的学生自主性学习实验基地”的目标，以转变教育思想、教育观念为先导，
          以提高教育质量为核心，以教学内容和手段的改革为关键，以师资队伍建设和教学条件建设为基础，以课程管理为保障，以专业外语课堂教学和网络教学有机融合玮突破点，打造专业外语精品课程，使该课程在省级精品课程和校级精品资源共享课建设的基础上，力求向省级精品资源共享课乃至国家级精品资源共享课程建设迈进，最终使大学英语课程拥有更优秀的师资、更先进的课程教学体系、教学方法、教学手段、教材建设等方面有突破性的进步、更成熟完备的课程教学网络基地和体系，同时发挥精品课程的示范、辐射作用，带动我院的课程建设，提高我院的课程教学质量。
        </div>
      </el-collapse-item>
      <el-collapse-item name="3">
        <div slot="title" :class="$style.title">
          课程建设步骤
        </div>
        <div :class="$style.content">
          1、加强课程师资队伍建设。通过引进、自我培养、请进来、走出去等措施，使大学英语课程师资队伍保持爱岗敬业、结构合理、在教学和科研上保持可持续发展的良好循环。<br />
          2、不断更新和完善大学英语分级教学体系改革，不断修订大学英语课程教学文件如教学大纲、教学日历和教案等。课程建设的核心是提高教学质量，为提高教学质量，在课程建设过程中对教学文件不断完善和改革，为专业外语课程教学质量提供有力保障。<br />
          3、不断改革教学内容、教学方法，采用现代教育技术教育手段，力求实现课堂教学和网络教学的有机融合的课堂教学模式，深化大学生专业外语自主性学习，提高教学质量，提高学生学习效率。<br />
          4、使用国家立体化教材，并加强专业外语辅助教材建设工作。深入研究教材，根据我校学生实际情况合理地设计课程内容，并积极进行配套教学辅助资料的建设，编写高质量的教材或教学参考书，关于专业外语的辅助教材即将于2008年或2009年公开出版。<br />
          5、进一步改革《专业外语》课程分级教学考核办法，实施更加科学、合理、全面的学业成绩考核办法。<br />
          6、加强教研室活动，深入教学改革和科学研究。始终坚持以科研促教学，不断进行外语教学理论和策略的学习，使教学能力和研究能力在质量上再上一台阶。<br />
          7、不断更新和丰富学生专业外语网上学习资源，完善《专业外语》网络课程体系，做到专业外语课程教学录像全程上网。<br />
          8、建立健全网络学习的规章制度，设立并完善网络学习指导和答疑模块。教师要制定好网络教学计划，特别是应为学生设计自主网上学习任务，包括网络语言学习与实践内容，如教师要对课堂学习的内容和通过网上学习的内容以及通过网上完成的作业量都应有预先的科学分配；教师还应加强网络课程学习的检查工作，并将学生上网学习情况作为学生学期总评成绩的重要依据。最终实现网上学习指导、答疑、考核等。<br />
          9、充分发挥专业外语第二课堂的作用，同时积极参加省级或学院大学生英语竞赛和演讲比赛，积极为学生寻求社会实践机遇，做到课内外学习相结合，全面提高学生的英语交际能力。<br />
        </div>
      </el-collapse-item>
    </el-collapse>
  </div>
</template>

<script>
export default {
  name: "FTPage7",
  data() {
    return {
      activeNames: ["1"]
    };
  },
  methods: {
    handleChange(val) {
      console.log(val);
    }
  }
};
</script>

<style lang="less" module>
.container {
  padding: 0 14px;
  .title {
    font-size: 24px;
  }
  .content {
    font-size: 16px;
  }
}
</style>
